bad_words = '''хуе
анус
трах
соси
заипал
саси
аборт
пезд
пизд
бздун
беспезды
бздюх
бля
блудилище
блядво
блядеха
блядина
блядистка
блядище
блядки
блядование
блядовать
блядовитый
блядовозка
блядолиз
блядоход
блядский
блядство
блядствовать
блядун
блядь
бляди
бляд
блядюга
блядюра
блядюшка
блядюшник
бордель
вагина
вафлист
вжопить
вжопиться
вздрачивание
вздрачивать
вздрачиваться
вздрочить
вздрочиться
вздрючить
вздрючивание
вздрючивать
взъебка
взъебщик
взъебнуть
вислозадая
влагалище
въебашивать
въебашиваться
въебашить
въебашиться
въебенивать
въебениваться
въебенить
въебениться
выблядок
выебанный
высрать
высраться
выссать
выссаться
высераться
выссереть
говнецо
говнистый
говниться
говно
говновоз
говнодав
говноеб
говноед
говномес
говномер
говносерка
говнюк
голожопая
гомик
гомосек
гондон
гонорея
давалка
двужопник
дерьмо
дерьмоед
дерьмовый
дилдо
додрочить
додрочиться
доебенивать
доебениваться
доебенить
доебениться
долбоеб
долбаеб
допизживать
дрисня
дристать
дристун
дроченье
дрочилыцик
дрочить
дрочиться
дрочка
дрючить
дрючиться
дурак
дуроеб
ебал
ебанатик
ебанашка
ебанутый
ебануть
ебануться
ебат
ебитесь
ебло
еблом
еблысь
ебля
ебнуть
ебнуться
ебня
ебучий
заебла
надроченный
объебешь
жирнозадый
жоп
забздеть
заблядовать
заблядоваться
задница
задрачивать
задрачиваться
задроченный
задрочить
задрочиться
задрючить
задрючиться
заеб
залуп
засранец
засранка
засранный
засратый
засраться
зассать
захуить
злоебучий
издрочиться
измандить
измандиться
измандовать
измандоваться
измандовывать
измандовываться
изъебашить
изъебашиться
изъебашивать
изъебашиваться
изъебенить
изъебениться
изъебенивать
изъебениваться
изъеб
испражнение
испражняться
какать
какашка
кастрат
кастрировать
клитор
клоака
кнахт
кончить
косоебить
косоебиться
кривохуй
курва
курвиный
лахудра
лохудра
лохматка
манда
мандавошка
мандавоха
мандить
мандиться
мандоватая
мандовать
мандохать
мандохаться
мандохивать
мандохиваться
мандошить
мастурбатор
минет
минетить
минетка
минетчик
минетчица
мозгоеб
мозгоебка
мокрожопый
мочиться
мудак
мудашвили
мудило
мудильщик
мудистый
мудить
мудоеб
наебанный
наебка
наебщик
наебывать
наебываться
наебыш
набздеть
наблядоваться
надроченный
надрочивать
надрочить
надрочиться
надристать
наебнуть
наебнуться
накакать
накакаться
накакивать
насрать
насраться
нассать
нассаться
натрахать
натрахаться
натрахивать
натрахиваться
нах
недоебанный
недоносок
неебущий
нищеебство
оебыват
обдристанный
обдристать
обдрочиться
обосранец
обосранная
обосраный
обосрать
обоссанец
обоссаный
обоссать
обоссаться
обоссаться
обоссывать
обоссываться
обтрахать
обтрахаться
обтрахивать
обтрахиваться
объебенить
объебнуть
объебон
одинхуй
однохуйственно
оебашивать
оебашить
оебенивать
оебенить
опедерастить
остоебеть
остоебенить
остоебенило
отдрачивать
отдрачиваться
отдрочить
отдрочиться
отсасывать
отсасываться
отсосать
отсосаться
оттраханная
оттрахать
оттрахаться
оттрахивать
оттрахиваться
отъебывание
отъебывать
отъебываться
отъебашить
отъебашивание
отъебашивать
отъебашиваться
отъебенить
отъебениться
отъебенивать
отъебениваться
отъебнуть
отьебашиться
отьебенивание
отьебнуться
охуительно
охуительный
перднуть
падла
падлюка
педераст
педерастина
педерастический
педерастия
педик
педрило
пежить
пенис
пердеж
пердеть
пердун
перебздеть
передрачивать
передрочить
передрочиться
переебашить
перетрахать
перетрахаться
перетрахивать
перетрахиваться
перехуйнуть
перехуйнуться
пидорас
пидор
писька
писюлек
плоскозадая
поебочка
поебывать
поебываться
поблудить
поблядовать
поблядушка
подосрать
подосраться
подоссать
подристывать
подрочить
подсирать
подъеб
подъебашить
подъебнуть
подъебка
подъебывать
подъябывать
поебанный
поебень
поебистика
поебон
поебончик
попердеть
попердеться
попердывать
попизживать
попизживаться
потаскун
потаскуха
потраханная
потрахать
потрахаться
потрахивать
потрахиваться
похуист
поц
пошмариться
поябывать
приебывать
приебываться
приебашить
приебашиться
приебашивать
приебашиваться
приебенить
приебениться
приебенивать
приебениваться
приебехать
приебехаться
приебехивать
приебехиваться
приебистый
приебурить
приебуриться
приебуривать
приебуриваться
прижопить
прижопывать
прикинуть
примандовать
примандоваться
примавдовывать
примандовываться
примандохать
примандохаться
примандохивать
примандохиваться
примандошить
примандошиться
примандошивать
примандошиваться
примандюкать
примандюкаться
примандюкивать
примандюкиваться
примандехать
примандехаться
примандехивать
примандехиваться
примандюлить
примандюлиться
примандюливать
примандюливаться
примандюрить
примандюриться
примандюривать
примандюриваться
примандякать
примандякаться
примандякивать
примандякиваться
примандярить
примандяриться
примандяривать
примандяриваться
примандяхать
примандяхаться
примандяхивать
примандяхиваться
примандячить
примандячиться
примандячивать
примандячиваться
примандяшить
примандяшиться
примандяшивать
примандяшиваться
примудохать
примудохаться
примудохивать
примудохиваться
примандить
примандиться
припизживать
припизживаться
притрахаться
проблядовать
проблядь
проблядушка
продрачивать
продрачиваться
продрочить
продрочиться
проебашить
проебашиться
проебашивать
проебашиваться
проебенить
проебениться
проебашивать
проебашиваться
проебывать
проебываться
пропизживать
пропизживаться
разблядоваться
раздрочить
раздрочиться
раззалупаться
разнохуйственно
разъебашить
разъебашиться
разъебашивать
разъебашиваться
разъебенить
разъебениться
разъебенивать
разъебениваться
сдрочить
сестроеб
сифилитик
сифилюга
скурвиться
смандить
смандиться
смандить
сперма
стерва
стервоза
сука
суки
сукин
сукины
суходрочка
суходрочкой
сучара
сучий
сучка
сучье
съебывать
съебываться
съебашить
съебашиться
съебашивать
съебашиваться
съебенить
съебениться
съебенивать
тварь
толстожопый
толстозадая
торчило
траханье
трахать
трахаться
трахнуть
трахнуться
трепак
триппер
уебывать
уебываться
уебыш
ублюдок
уеба
уебенить
уебище
усраться
усрачка
уссать
уссаться
фаллос
фекал
фекалий
фекалии
хер
хуе
худоебина
хуила
хуиный
хуистый
хуишко
хуище
хуи
хуило
хули
хую
хуя
целка
целку
целочка
черножопые
чернозадый
шалава
шлюха
шмара
шмарить
шмариться
отъебись
отьебись
мудила
пидарасы
ублан
еблан
негр'''.splitlines()
not_bad_words = '''упортребля
her
'''.splitlines()
en_ru_map = {
    'a': 'а',   # латинская a
    'b': 'в',   # латинская b
    'c': 'с',   # латинская c
    'e': 'е',   # латинская e
    'k': 'к',   # латинская k
    'm': 'м',   # латинская m
    'o': 'о',   # латинская o
    'p': 'р',   # латинская p
    't': 'т',   # латинская t
    'x': 'х',   # латинская x
    'y': 'у',   # латинская y
    'i': 'і',   # украинская i
    'ł': 'л',   # польская ł
    'ź': 'з',   # польская ź
    'ä': 'а',   # немецкая ä
    'ö': 'о',   # немецкая ö
    'ü': 'ю',   # немецкая ü
    'đ': 'д',   # вьетнамская đ
    'þ': 'т',   # исландская þ
    'ð': 'д',   # исландская ð
    'æ': 'э',   # датская/исландская æ
    'ç': 'с',   # турецкая ç
    'ñ': 'н',   # испанская ñ
    'ş': 'ш',   # турецкая ş
    'đ': 'д',   # хорватская/сербская đ
    'þ': 'т',   # исландская þ
    'ğ': 'г',   # турецкая ğ
    'ş': 'ш',   # турецкая ş
    'ı': 'и',   # турецкая ı
    'å': 'а',   # шведская/норвежская å
    'ø': 'ё',   # датская/норвежская ø
    'ā': 'а',   # латвийская ā
    'č': 'ч',   # чешская/латвийская č
    'ē': 'е',   # латвийская ē
    'ģ': 'г',   # латвийская ģ
    'ī': 'и',   # латвийская ī
    'ļ': 'л',   # латвийская ļ
    'ņ': 'н',   # латвийская ņ
    'š': 'ш',   # латвийская/литовская š
    'ū': 'у',   # латвийская ū
    'ž': 'ж',   # латвийская/литовская ž
    'ç': 'с',   # французская/турецкая ç
    'ý': 'и',   # туркменская ý
    'ş': 'ш',   # азербайджанская ş
    'ə': 'э',   # азербайджанская ə
    'ã': 'а',   # португальская ã
    'ě': 'е',   # чешская ě
    'ä': 'а',   # финская ä
    'ű': 'у',   # венгерская ű
    'õ': 'о',   # эстонская õ
    'č': 'ч',   # хорватская/чешская/литовская/латвийская č
    'đ': 'д',   # сербская/хорватская đ
    'š': 'ш',   # хорватская/чешская/литовская/латвийская š
    'ž': 'ж',   # хорватская/чешская/литовская/латвийская ž
    'ı': 'и',   # турецкая ı
    'ū': 'у',   # литовская ū
    'å': 'а',   # шведская/норвежская/датская å
    'ä': 'а',   # шведская ä
    'ö': 'о',   # шведская ö
    'é': 'е',   # французская é
    'è': 'е',   # французская è
    'ê': 'е',   # французская ê
    'ç': 'с',   # французская ç
    'à': 'а',   # французская à
    'ô': 'о',   # французская ô
    'ù': 'у',   # французская ù
    'ñ': 'н',   # галисийская/испанская/баскская ñ
    'ï': 'и',   # каталонская ï
    'ý': 'и',   # чешская/туркменская ý
    'č': 'ч',   # словенская/словацкая/чешская č
    'ľ': 'л',   # словацкая ľ
    'ň': 'н',   # чешская/словацкая ň
    'ű': 'у',   # венгерская ű
    'ő': 'ё',   # венгерская ő
    'ä': 'а',   # эстонская ä
    'õ': 'о',   # эстонская õ
    'ü': 'ю',   # венгерская/немецкая/эстонская ü
    'õ': 'о',   # эстонская õ
    'ø': 'ё',   # датская/норвежская ø
    'á': 'а',   # венгерская á
    'å': 'а',   # норвежская å
    'è': 'е',   # итальянская è
    'ò': 'о',   # итальянская ò
    'ì': 'и',   # итальянская ì
    'à': 'а',   # итальянская à
    'é': 'е',   # испанская/португальская/итальянская/французская/венгерская é
    'α': 'а',   # греческая альфа
    'β': 'в',   # греческая бета
    'γ': 'г',   # греческая гамма
    'δ': 'д',   # греческая дельта
    'ε': 'е',   # греческая эпсилон
    'ζ': 'з',   # греческая зета
    'η': 'и',   # греческая эта
    'θ': 'ф',   # греческая тета
    'ι': 'и',   # греческая йота
    'κ': 'к',   # греческая каппа
    'λ': 'л',   # греческая лямбда
    'μ': 'м',   # греческая мю
    'ν': 'н',   # греческая ню
    'ξ': 'кс',  # греческая кси
    'ο': 'о',   # греческая омега
    'π': 'п',   # греческая пи
    'ρ': 'р',   # греческая ро
    'σ': 'с',   # греческая сигма
    'τ': 'т',   # греческая тау
    'υ': 'у',   # греческая ипсилон
    'φ': 'ф',   # греческая фи
    'χ': 'х',   # греческая хи
    'ψ': 'пс',  # греческая пси
    'ω': 'о',   # греческая омега
    'א': 'а',   # ивритская алеф
    'ב': 'б',   # ивритская бет
    'ג': 'г',   # ивритская гимел
    'ד': 'д',   # ивритская далет
    'ה': 'е',   # ивритская хе
    'ו': 'в',   # ивритская вав
    'ז': 'з',   # ивритская зайн
    'ח': 'х',   # ивритская хет
    'ט': 'т',   # ивритская тет
    'י': 'и',   # ивритская йод
    'כ': 'к',   # ивритская каф
    'ל': 'л',   # ивритская ламед
    'מ': 'м',   # ивритская мем
    'נ': 'н',   # ивритская нун
    'ס': 'с',   # ивритская самех
    'ע': 'а',   # ивритская аин
    'פ': 'п',   # ивритская пе
    'צ': 'ц',   # ивритская цади
    'ק': 'к',   # ивритская куф
    'ר': 'р',   # ивритская реш
    'ש': 'ш',   # ивритская шин
    'ת': 'т',   # ивритская тав
    'ㄱ': 'г',   # корейский киёк
    'ㄴ': 'н',   # корейский ниын
    'ㄷ': 'д',   # корейский тигыт
    'ㄹ': 'л',   # корейский риыль
    'ㅁ': 'м',   # корейский миым
    'ㅂ': 'б',   # корейский пиып
    'ㅅ': 'с',   # корейский сиот
    'ㅇ': 'н',   # корейский иынг
    'ㅈ': 'ч',   # корейский чиыт
    'ㅎ': 'х',   # корейский хиыт
    '一': 'и',   # китайский иероглиф "один"
    '二': 'и',   # китайский иероглиф "два"
    '人': 'н',   # китайский иероглиф "человек"
    '口': 'о',   # китайский иероглиф "рот"
    '山': 'м',   # китайский иероглиф "гора"
    '川': 'ч',   # китайский иероглиф "река"
    '水': 'ш',   # китайский иероглиф "вода"
    '火': 'ф',   # китайский иероглиф "огонь"
    '木': 'м',   # китайский иероглиф "дерево"
    '土': 'т',   # китайский иероглиф "земля"
    '4': 'ч',
    '3': 'з',
    '0': 'о',
    '6': 'б',
    'ў': 'у'
}
